app/controllers/petitions_controller.rb

SELECT "petitions".* FROM "petitions" ORDER BY id DESC
---
  def index
    @petitions = Petition.all

INSERT INTO "petitions" ("cover", "created_at", "description", "signum", "target", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @petition = Petition.new(petition_params)

    respond_to do |format|
      if @petition.save

UPDATE "petitions" SET "description" = ?, "updated_at" = ? WHERE "petitions"."id" = 1
---
  def update
    respond_to do |format|
      if @petition.update(petition_params)

SELECT "petitions".* FROM "petitions" WHERE "petitions"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_petition
      @petition = Petition.find(params[:id])